-- създаваме си схемата коята ще ползваме и сет-нете search_path:

-- 1. Дефинирайте следните релации:

-- а) Product(maker, model, type), където моделът е низ от
-- точно 4 символа, maker - един символ,
-- а type - низ до 7 символа;

-- б) Printer(code, model, color, price),
-- където code е цяло число, color е 'y' или 'n'
-- и по подразбиране е 'n', price - цена с точност
-- до два знака след десетичната запетая;

-- в) Classes(class, type), където class е до
-- 50 символа, а type може да бъде 'bb' или 'bc'.

-- 2. Добавете кортежи с примерни данни към
-- новосъздадените релации. Добавете информация за принтер,
-- за когото знаем само кода и модела.

-- Добавете кортежи с примерни данни към
-- новосъздадените релации по ваша преценка


-- Добавете информация за принтер (сложете стойност на някое празно поле),
-- за когото знаем само кода и модела:


-- 3. Добавете към Classes атрибут bore - число с плаваща запетая.

-- 4. Напишете заявка, която премахва атрибута price от Printer.

-- 5. Изтрийте всички таблици, които сте създали в това упражнение.
