-- Използвайте редуцираните скриптове за Movies, PC и Ships от папката ReducedScripts, в които няма ограничения за референтна цялост и т.н.

-- Да се добави информация за актрисата Nicole Kidman. За нея знаем само, че е родена на 20-и юни 1967.

-- Да се изтрият всички продуценти с печалба (networth) под 10 милиона.

-- Да се изтрие информацията за всички филмови звезди, за които не се знае адреса.

-- Използвайки две INSERT заявки, съхранете в базата данни факта, че персонален компютър модел 1100 е направен от производителя C, има процесор 2400 MHz, RAM 2048 MB, твърд диск 500 GB, 52x DVD устройство и струва $299. Нека новият компютър има код 12. Забележка: моделът и CD са от тип низ.
-- Упътване: самото вмъкване на данни е очевидно как ще стане, помислете в какъв ред е по-логично да са двете заявки.

-- Да се изтрие всичката налична информация за компютри модел 1100.

-- За всеки персонален компютър се продава и 15-инчов лаптоп със същите параметри, но с $500 по-скъп. Кодът на такъв лаптоп е със 100 по-голям от кода на съответния компютър. Добавете тази информация в базата.

-- Да се изтрият всички лаптопи, направени от производител, който не произвежда принтери.
-- Упътване: Мислете си, че решавате задача от познат тип - "Да се изведат всички лаптопи, ...". Накрая ще е нужна съвсем малка промяна. Ако започнете директно да триете, много е вероятно при някой грешен опит да изтриете всички лаптопи и ще трябва често да възстановявате таблицата или да работите на сляпо.

-- Производител А купува производител B. На всички продукти на В променете производителя да бъде А.

-- Да се намали два пъти цената на всеки компютър и да се добавят по 20 GB към всеки твърд диск. Упътване: няма нужда от две отделни заявки.

-- За всеки лаптоп от производител B добавете по един инч към диагонала на екрана.

-- Два британски бойни кораба от класа Nelson - Nelson и Rodney - са били пуснати на вода едновременно през 1927 г. Имали са девет 16-инчови оръдия (bore) и водоизместимост от 34 000 тона (displacement). Добавете тези факти към базата от данни.

-- Изтрийте от Ships всички кораби, които са потънали в битка.

-- Променете данните в релацията Classes така, че калибърът (bore) да се измерва в сантиметри (в момента е в инчове, 1 инч ~ 2.5 см) и водоизместимостта да се измерва в метрични тонове (1 м.т. = 1.1 т.)

-- Изтрийте всички класове, от които има по-малко от три кораба.

-- Променете калибъра на оръдията и водоизместимостта на класа Iowa, така че да са същите като тези на класа Bismarck.